renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx660/register_access/gnuc/iodefine.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RRCV : 4;
			unsigned short  : 4;
			unsigned short WRCV : 4;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short WRCV : 4;
			unsigned short  : 4;
			unsigned short RRCV : 4;
#endif
	} BIT;
	} CS0REC;
	char           wk10[6];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short EXENB : 1;
			unsigned short  : 3;
			unsigned short BSIZE : 2;
			unsigned short  : 2;
			unsigned short EMODE : 1;
			unsigned short  : 3;
			unsigned short MPXEN : 1;
			unsigned short  : 3;
#else
			unsigned short  : 3;
			unsigned short MPXEN : 1;
			unsigned short  : 3;
			unsigned short EMODE : 1;
			unsigned short  : 2;
			unsigned short BSIZE : 2;
			unsigned short  : 3;
			unsigned short EXENB : 1;
#endif
	} BIT;
	} CS1CR;
	char           wk11[6];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RRCV : 4;
			unsigned short  : 4;
			unsigned short WRCV : 4;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short WRCV : 4;
			unsigned short  : 4;
			unsigned short RRCV : 4;
#endif
	} BIT;
	} CS1REC;
	char           wk12[6];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short EXENB : 1;
			unsigned short  : 3;
			unsigned short BSIZE : 2;
			unsigned short  : 2;
			unsigned short EMODE : 1;
			unsigned short  : 3;
			unsigned short MPXEN : 1;
			unsigned short  : 3;
#else
			unsigned short  : 3;
			unsigned short MPXEN : 1;
			unsigned short  : 3;
			unsigned short EMODE : 1;
			unsigned short  : 2;
			unsigned short BSIZE : 2;
			unsigned short  : 3;
			unsigned short EXENB : 1;
#endif
	} BIT;
	} CS2CR;
	char           wk13[6];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RRCV : 4;
			unsigned short  : 4;
			unsigned short WRCV : 4;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short WRCV : 4;
			unsigned short  : 4;
			unsigned short RRCV : 4;
#endif
	} BIT;
	} CS2REC;
	char           wk14[6];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short EXENB : 1;
			unsigned short  : 3;
			unsigned short BSIZE : 2;
			unsigned short  : 2;
			unsigned short EMODE : 1;
			unsigned short  : 3;
			unsigned short MPXEN : 1;
			unsigned short  : 3;
#else
			unsigned short  : 3;
			unsigned short MPXEN : 1;
			unsigned short  : 3;
			unsigned short EMODE : 1;
			unsigned short  : 2;
			unsigned short BSIZE : 2;
			unsigned short  : 3;
			unsigned short EXENB : 1;
#endif
	} BIT;
	} CS3CR;
	char           wk15[6];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RRCV : 4;
			unsigned short  : 4;
			unsigned short WRCV : 4;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short WRCV : 4;
			unsigned short  : 4;
			unsigned short RRCV : 4;
#endif
	} BIT;
	} CS3REC;
	char           wk16[68];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RCVEN0 : 1;
			unsigned short RCVEN1 : 1;
			unsigned short RCVEN2 : 1;
			unsigned short RCVEN3 : 1;
			unsigned short RCVEN4 : 1;
			unsigned short RCVEN5 : 1;
			unsigned short RCVEN6 : 1;
			unsigned short RCVEN7 : 1;
			unsigned short RCVENM0 : 1;
			unsigned short RCVENM1 : 1;
			unsigned short RCVENM2 : 1;
			unsigned short RCVENM3 : 1;
			unsigned short RCVENM4 : 1;
			unsigned short RCVENM5 : 1;
			unsigned short RCVENM6 : 1;
			unsigned short RCVENM7 : 1;
#else
			unsigned short RCVENM7 : 1;
			unsigned short RCVENM6 : 1;
			unsigned short RCVENM5 : 1;
			unsigned short RCVENM4 : 1;
			unsigned short RCVENM3 : 1;
			unsigned short RCVENM2 : 1;
			unsigned short RCVENM1 : 1;
			unsigned short RCVENM0 : 1;
			unsigned short RCVEN7 : 1;
			unsigned short RCVEN6 : 1;
			unsigned short RCVEN5 : 1;
			unsigned short RCVEN4 : 1;
			unsigned short RCVEN3 : 1;
			unsigned short RCVEN2 : 1;
			unsigned short RCVEN1 : 1;
			unsigned short RCVEN0 : 1;
#endif
	} BIT;
	} CSRECEN;
} st_bsc_t;

typedef struct st_cac {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CFME : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char CFME : 1;
#endif
	} BIT;
	} CACR0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CACREFE : 1;
			unsigned char FMCS : 3;
			unsigned char TCSS : 2;
			unsigned char EDGES : 2;
#else
			unsigned char EDGES : 2;
			unsigned char TCSS : 2;
			unsigned char FMCS : 3;
			unsigned char CACREFE : 1;
#endif
	} BIT;
	} CACR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char RPS : 1;
			unsigned char RSCS : 3;
			unsigned char RCDS : 2;
			unsigned char DFS : 2;
#else
			unsigned char DFS : 2;
			unsigned char RCDS : 2;
			unsigned char RSCS : 3;
			unsigned char RPS : 1;
#endif
	} BIT;
	} CACR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FERRIE : 1;
			unsigned char MENDIE : 1;
			unsigned char OVFIE : 1;
			unsigned char  : 1;
			unsigned char FERRFCL : 1;
			unsigned char MENDFCL : 1;
			unsigned char OVFFCL : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char OVFFCL : 1;
			unsigned char MENDFCL : 1;
			unsigned char FERRFCL : 1;
			unsigned char  : 1;
			unsigned char OVFIE : 1;
			unsigned char MENDIE : 1;
			unsigned char FERRIE : 1;
#endif
	} BIT;
	} CAICR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FERRF : 1;
			unsigned char MENDF : 1;
			unsigned char OVFF : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char OVFF : 1;
			unsigned char MENDF : 1;
			unsigned char FERRF : 1;
#endif
	} BIT;
	} CASTR;
	char           wk0[1];
	unsigned short CAULVR;
	unsigned short CALLVR;
	unsigned short CACNTBR;
} st_cac_t;

typedef struct st_canfd {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TPRI : 1;
			unsigned long DCE : 1;
			unsigned long DRE : 1;
			unsigned long MME : 1;
			unsigned long DLLCS : 1;
			unsigned long OMRC : 1;
			unsigned long  : 2;
			unsigned long TSP : 4;
			unsigned long TSCS : 1;
			unsigned long  : 3;
			unsigned long ITP : 16;
#else
			unsigned long ITP : 16;
			unsigned long  : 3;
			unsigned long TSCS : 1;
			unsigned long TSP : 4;
			unsigned long  : 2;
			unsigned long OMRC : 1;
			unsigned long DLLCS : 1;
			unsigned long MME : 1;
			unsigned long DRE : 1;
			unsigned long DCE : 1;
			unsigned long TPRI : 1;
#endif
	} BIT;
	} GCFG;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MDC : 2;
			unsigned long SLPRQ : 1;
			unsigned long  : 5;
			unsigned long DEIE : 1;
			unsigned long MLIE : 1;
			unsigned long THLIE : 1;
			unsigned long POIE : 1;
			unsigned long  : 4;
			unsigned long TSCR : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long TSCR : 1;
			unsigned long  : 4;
			unsigned long POIE : 1;
			unsigned long THLIE : 1;
			unsigned long MLIE : 1;
			unsigned long DEIE : 1;
			unsigned long  : 5;
			unsigned long SLPRQ : 1;
			unsigned long MDC : 2;
#endif
	} BIT;
	} GCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RSTST : 1;
			unsigned long HLTST : 1;
			unsigned long SLPST : 1;
			unsigned long RAMST : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long RAMST : 1;
			unsigned long SLPST : 1;
			unsigned long HLTST : 1;
			unsigned long RSTST : 1;
#endif
	} BIT;
	} GSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DEDF : 1;
			unsigned long MLDF : 1;
			unsigned long THLDF : 1;
			unsigned long PODF : 1;
			unsigned long  : 12;
			unsigned long EEDF0 : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long EEDF0 : 1;
			unsigned long  : 12;
			unsigned long PODF : 1;
			unsigned long THLDF : 1;
			unsigned long MLDF : 1;
			unsigned long DEDF : 1;
#endif
	} BIT;
	} GESR;
	unsigned long  TSCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PAGE : 1;
			unsigned long  : 7;
			unsigned long AFLWE : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long AFLWE : 1;
			unsigned long  : 7;
			unsigned long PAGE : 1;
#endif
	} BIT;
	} AFCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 16;
			unsigned long RN0 : 6;
			unsigned long  : 10;
#else
			unsigned long  : 10;
			unsigned long RN0 : 6;
			unsigned long  : 16;
#endif
	} BIT;
	} AFCFG;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long NMB : 6;
			unsigned long  : 2;
			unsigned long PLS : 3;
			unsigned long  : 21;
#else
			unsigned long  : 21;
			unsigned long PLS : 3;
			unsigned long  : 2;
			unsigned long NMB : 6;
#endif
	} BIT;
	} RMCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long NDF : 32;
#else
			unsigned long NDF : 32;
#endif
	} BIT;
	} RMNDR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RMIE0 : 1;
			unsigned long RMIE1 : 1;
			unsigned long RMIE2 : 1;
			unsigned long RMIE3 : 1;
			unsigned long RMIE4 : 1;
			unsigned long RMIE5 : 1;
			unsigned long RMIE6 : 1;
			unsigned long RMIE7 : 1;
			unsigned long RMIE8 : 1;
			unsigned long RMIE9 : 1;
			unsigned long RMIE10 : 1;
			unsigned long RMIE11 : 1;
			unsigned long RMIE12 : 1;
			unsigned long RMIE13 : 1;
			unsigned long RMIE14 : 1;
			unsigned long RMIE15 : 1;
			unsigned long RMIE16 : 1;
			unsigned long RMIE17 : 1;
			unsigned long RMIE18 : 1;
			unsigned long RMIE19 : 1;
			unsigned long RMIE20 : 1;
			unsigned long RMIE21 : 1;
			unsigned long RMIE22 : 1;
			unsigned long RMIE23 : 1;
			unsigned long RMIE24 : 1;
			unsigned long RMIE25 : 1;
			unsigned long RMIE26 : 1;
			unsigned long RMIE27 : 1;
			unsigned long RMIE28 : 1;
			unsigned long RMIE29 : 1;
			unsigned long RMIE30 : 1;
			unsigned long RMIE31 : 1;
#else
			unsigned long RMIE31 : 1;
			unsigned long RMIE30 : 1;
			unsigned long RMIE29 : 1;
			unsigned long RMIE28 : 1;
			unsigned long RMIE27 : 1;
			unsigned long RMIE26 : 1;
			unsigned long RMIE25 : 1;
			unsigned long RMIE24 : 1;
			unsigned long RMIE23 : 1;
			unsigned long RMIE22 : 1;
			unsigned long RMIE21 : 1;
			unsigned long RMIE20 : 1;
			unsigned long RMIE19 : 1;
			unsigned long RMIE18 : 1;
			unsigned long RMIE17 : 1;
			unsigned long RMIE16 : 1;
			unsigned long RMIE15 : 1;
			unsigned long RMIE14 : 1;
			unsigned long RMIE13 : 1;
			unsigned long RMIE12 : 1;
			unsigned long RMIE11 : 1;
			unsigned long RMIE10 : 1;
			unsigned long RMIE9 : 1;
			unsigned long RMIE8 : 1;
			unsigned long RMIE7 : 1;
			unsigned long RMIE6 : 1;
			unsigned long RMIE5 : 1;
			unsigned long RMIE4 : 1;
			unsigned long RMIE3 : 1;
			unsigned long RMIE2 : 1;
			unsigned long RMIE1 : 1;
			unsigned long RMIE0 : 1;
#endif
	} BIT;
	} RMIER;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RFE : 1;
			unsigned long RFIE : 1;
			unsigned long  : 2;
			unsigned long PLS : 3;
			unsigned long  : 1;
			unsigned long FDS : 3;
			unsigned long  : 1;
			unsigned long RFIM : 1;
			unsigned long RFITH : 3;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long RFITH : 3;
			unsigned long RFIM : 1;
			unsigned long  : 1;
			unsigned long FDS : 3;
			unsigned long  : 1;
			unsigned long PLS : 3;
			unsigned long  : 2;
			unsigned long RFIE : 1;
			unsigned long RFE : 1;
#endif
	} BIT;
	} RFCR[2];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EMPTY : 1;
			unsigned long FULL : 1;
			unsigned long LOST : 1;
			unsigned long RFIF : 1;
			unsigned long  : 4;
			unsigned long FLVL : 6;
			unsigned long  : 18;
#else
			unsigned long  : 18;
			unsigned long FLVL : 6;
			unsigned long  : 4;
			unsigned long RFIF : 1;
			unsigned long LOST : 1;
			unsigned long FULL : 1;
			unsigned long EMPTY : 1;
#endif
	} BIT;
	} RFSR[2];
	unsigned long  RFPCR[2];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CFE : 1;
			unsigned long CFRIE : 1;
			unsigned long CFTIE : 1;
			unsigned long  : 1;
			unsigned long PLS : 3;
			unsigned long  : 1;
			unsigned long MODE : 1;
			unsigned long  : 1;
			unsigned long ITCS : 1;
			unsigned long ITR : 1;
			unsigned long CFIM : 1;
			unsigned long CFITH : 3;
			unsigned long LTM : 2;
			unsigned long  : 3;
			unsigned long FDS : 3;
			unsigned long TINT : 8;
#else
			unsigned long TINT : 8;
			unsigned long FDS : 3;
			unsigned long  : 3;
			unsigned long LTM : 2;
			unsigned long CFITH : 3;
			unsigned long CFIM : 1;
			unsigned long ITR : 1;
			unsigned long ITCS : 1;
			unsigned long  : 1;
			unsigned long MODE : 1;
			unsigned long  : 1;
			unsigned long PLS : 3;
			unsigned long  : 1;
			unsigned long CFTIE : 1;
			unsigned long CFRIE : 1;
			unsigned long CFE : 1;
#endif
	} BIT;
	} CFCR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EMPTY : 1;
			unsigned long FULL : 1;
			unsigned long LOST : 1;
			unsigned long CFRIF : 1;
			unsigned long CFTIF : 1;
			unsigned long  : 3;
			unsigned long FLVL : 6;
			unsigned long  : 18;
#else
			unsigned long  : 18;
			unsigned long FLVL : 6;
			unsigned long  : 3;
			unsigned long CFTIF : 1;
			unsigned long CFRIF : 1;
			unsigned long LOST : 1;
			unsigned long FULL : 1;
			unsigned long EMPTY : 1;
#endif
	} BIT;
	} CFSR0;
	unsigned long  CFPCR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RFEMP0 : 1;
			unsigned long RFEMP1 : 1;
			unsigned long  : 6;
			unsigned long CFEMP0 : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long CFEMP0 : 1;
			unsigned long  : 6;
			unsigned long RFEMP1 : 1;
			unsigned long RFEMP0 : 1;
#endif
	} BIT;
	} FESR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RFFUL0 : 1;
			unsigned long RFFUL1 : 1;
			unsigned long  : 6;
			unsigned long CFFUL0 : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long CFFUL0 : 1;
			unsigned long  : 6;
			unsigned long RFFUL1 : 1;
			unsigned long RFFUL0 : 1;
#endif
	} BIT;
	} FFSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RFML0 : 1;
			unsigned long RFML1 : 1;
			unsigned long  : 6;
			unsigned long CFML0 : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long CFML0 : 1;
			unsigned long  : 6;
			unsigned long RFML1 : 1;
			unsigned long RFML0 : 1;
#endif
	} BIT;
	} FMLSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RFIF0 : 1;
			unsigned long RFIF1 : 1;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long RFIF1 : 1;
			unsigned long RFIF0 : 1;
#endif
	} BIT;
	} RFISR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char TXRQ : 1;
			unsigned char TARQ : 1;
			unsigned char ONESHOT : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char ONESHOT : 1;
			unsigned char TARQ : 1;
			unsigned char TXRQ : 1;
#endif
	} BIT;
	} TMCR[4];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char TXSF : 1;
			unsigned char TXRF : 2;
			unsigned char TXRQS : 1;
			unsigned char TARQS : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char TARQS : 1;
			unsigned char TXRQS : 1;
			unsigned char TXRF : 2;
			unsigned char TXSF : 1;
#endif
	} BIT;
	} TMSR[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TXRQS0 : 1;
			unsigned long TXRQS1 : 1;
			unsigned long TXRQS2 : 1;
			unsigned long TXRQS3 : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long TXRQS3 : 1;
			unsigned long TXRQS2 : 1;
			unsigned long TXRQS1 : 1;
			unsigned long TXRQS0 : 1;
#endif
	} BIT;
	} TMTRSR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TARQS0 : 1;
			unsigned long TARQS1 : 1;
			unsigned long TARQS2 : 1;
			unsigned long TARQS3 : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long TARQS3 : 1;
			unsigned long TARQS2 : 1;
			unsigned long TARQS1 : 1;
			unsigned long TARQS0 : 1;
#endif
	} BIT;
	} TMARSR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TXCF0 : 1;
			unsigned long TXCF1 : 1;
			unsigned long TXCF2 : 1;
			unsigned long TXCF3 : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long TXCF3 : 1;
			unsigned long TXCF2 : 1;
			unsigned long TXCF1 : 1;
			unsigned long TXCF0 : 1;
#endif
	} BIT;
	} TMTCSR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TAF0 : 1;
			unsigned long TAF1 : 1;
			unsigned long TAF2 : 1;
			unsigned long TAF3 : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long TAF3 : 1;
			unsigned long TAF2 : 1;
			unsigned long TAF1 : 1;
			unsigned long TAF0 : 1;
#endif
	} BIT;
	} TMTASR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TMIE0 : 1;
			unsigned long TMIE1 : 1;
			unsigned long TMIE2 : 1;
			unsigned long TMIE3 : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long TMIE3 : 1;
			unsigned long TMIE2 : 1;
			unsigned long TMIE1 : 1;
			unsigned long TMIE0 : 1;
#endif
	} BIT;
	} TMIER0;
	char           wk0[24];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TSIF0 : 1;
			unsigned long TAIF0 : 1;
			unsigned long TQIF0 : 1;
			unsigned long CFTIF0 : 1;
			unsigned long THIF0 : 1;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long THIF0 : 1;
			unsigned long CFTIF0 : 1;
			unsigned long TQIF0 : 1;
			unsigned long TAIF0 : 1;
			unsigned long TSIF0 : 1;
#endif
	} BIT;
	} TISR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 16;
			unsigned long RTPS : 4;
			unsigned long  : 12;
#else
			unsigned long  : 12;
			unsigned long RTPS : 4;
			unsigned long  : 16;
#endif
	} BIT;
	} GTMCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 2;
			unsigned long RTME : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long RTME : 1;
			unsigned long  : 2;
#endif
	} BIT;
	} GTMER;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PXEDIS : 1;
			unsigned long  : 7;
			unsigned long TSCPS : 2;
			unsigned long  : 22;
#else
			unsigned long  : 22;
			unsigned long TSCPS : 2;
			unsigned long  : 7;
			unsigned long PXEDIS : 1;
#endif
	} BIT;
	} GFDCFG;
	char           wk1[4];
	unsigned long  GTMLKR;
	char           wk2[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IGES : 5;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long IGES : 5;
#endif
	} BIT;
	} AFIGSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IGEE : 1;
			unsigned long  : 7;
			unsigned long KEY : 8;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long KEY : 8;
			unsigned long  : 7;
			unsigned long IGEE : 1;
#endif
	} BIT;
	} AFIGER;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RFDTE0 : 1;
			unsigned long RFDTE1 : 1;
			unsigned long  : 6;
			unsigned long CFDTE0 : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long CFDTE0 : 1;
			unsigned long  : 6;
			unsigned long RFDTE1 : 1;
			unsigned long RFDTE0 : 1;
#endif
	} BIT;
	} DTCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RFDTS0 : 1;
			unsigned long RFDTS1 : 1;
			unsigned long  : 6;
			unsigned long CFDTS0 : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long CFDTS0 : 1;
			unsigned long  : 6;
			unsigned long RFDTS1 : 1;
			unsigned long RFDTS0 : 1;
#endif
	} BIT;
	} DTSR;
	char           wk3[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SRST : 1;
			unsigned long  : 7;
			unsigned long KEY : 8;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long KEY : 8;
			unsigned long  : 7;
			unsigned long SRST : 1;
#endif
	} BIT;
	} GRCR;
	char           wk4[68];
	struct {
		union {
			unsigned long LONG;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long LPC : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long LPC : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} IDR;
		union {
			unsigned long LONG;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IDM : 29;
			unsigned long IFL1 : 1;
			unsigned long RTRM : 1;
			unsigned long IDEM : 1;
#else
			unsigned long IDEM : 1;
			unsigned long RTRM : 1;
			unsigned long IFL1 : 1;
			unsigned long IDM : 29;
#endif
	} BIT;
		} MASK;
		union {
			unsigned long LONG;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DLC : 4;
			unsigned long  : 3;
			unsigned long IFL0 : 1;
			unsigned long DMB : 5;
			unsigned long  : 2;
			unsigned long DMBE : 1;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long DMBE : 1;
			unsigned long  : 2;
			unsigned long DMB : 5;
			unsigned long IFL0 : 1;
			unsigned long  : 3;
			unsigned long DLC : 4;
#endif
	} BIT;
		} PTR0;
		union {
			unsigned long LONG;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RF0E : 1;
			unsigned long RF1E : 1;
			unsigned long  : 6;
			unsigned long CF0E : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long CF0E : 1;
			unsigned long  : 6;
			unsigned long RF1E : 1;
			unsigned long RF0E : 1;
#endif
	} BIT;
		} PTR1;
	} AFL[16];
	char           wk5[96];
	unsigned long  RTPAR[64];
	char           wk6[416];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
