renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx660/register_access/gnuc/iodefine.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RFB[2];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long THENT : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long THENT : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} CFB[1];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long THENT : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long THENT : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 28;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 28;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} TMB[4];
	char           wk7[492];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB0;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB1;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB2;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB3;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB4;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB5;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB6;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB7;
	char           wk8[416];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB8;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB9;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
